examples/OF_turbulence_model/baseCase/0/epsilon
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object epsilon;
}

dimensions [ 0 2 -3 0 0 0 0 ];

internalField uniform 17.8;

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField;
  }
  outlet
  {
    type zeroGradient;
  }
  "(lowerWallStartup|upperWallStartup)"
  {
    type symmetryPlane;
  }
  "(upperWall|lowerWall)"
  {
    type epsilonWallFunction;
    value $internalField;
  }
  "(front|back)"
  {
    type empty;
  }
} 	// ************************************************************************* //

