examples/OF_turbulence_model/baseCase/0/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object k;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.001090424166; 	// 0.061%

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField;
  }
  outlet
  {
    type zeroGradient;
  }
  "(lowerWallStartup|upperWallStartup)"
  {
    type symmetryPlane;
  }
  "(upperWall|lowerWall)"
  {
    type kqRWallFunction;
    value $internalField;
  }
  "(front|back)"
  {
    type empty;
  }
} 	// ************************************************************************* //

