examples/OF_turbulence_model/baseCase/0/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object omega;
}

dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform 180833;

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField;
  }
  outlet
  {
    type zeroGradient;
  }
  "(lowerWallStartup|upperWallStartup)"
  {
    type symmetryPlane;
  }
  "(upperWall|lowerWall)"
  {
    type omegaWallFunction;
    value $internalField;
  }
  "(front|back)"
  {
    type empty;
  }
} 	// ************************************************************************* //

